# 프로그래머스 고득점 Kit _ Brute Force 3번문제



          
          
"""

1) 내가 이끌어 낸 지점 :

- 정사각형

1개 -> 닿는 면적 :(1*4)=4개   +   모서리 : 4개 ------->8개  +노랑(1)   |9    (3,3)
4개 -> 닿는 면적 :(2*4)=8개   +   모서리 : 4개 ------->12개 +노랑(4)   |16   (4,4)
9개 -> 닿는 면적 :(3*4)=12개  +   모서리 : 4개 ------->16개 +노랑(9)   |25   (5,5)
16개-> 닿는 면적 :(4*4)=16개  +   모서리 : 4개 ------->20개 +노랑(16)  |36   (6,6)

- 직사각형

(2,1)      ->   닿는거 6개     +4     |10

(3,1)      ->   닿는거 8개     +4     |12
(3,2)      ->   닿는거 10개    +4     |14

(4,1)      ->   닿는거 10개    +4     |14
(4,2)      ->   닿는거 12개    +4     |16
(4,3)      ->   닿는거 14개    +4     |18


뭔가 풀 수 있을 것 같아서 일단 보류

 # 프로그래머스 문제 링크 : https://programmers.co.kr/learn/courses/30/lessons/42842
 
"""
